st-one/X-CUBE-USB-PD/STM32CubeExpansion_USBPD_F0/Projects/STM32F072RB-Nucleo/Applications/USB_PD/Consumer_VDM_RTOS/Src/usbpd_dpm.c
  osThreadDef(CADTask, USBPD_CAD_Task, osPriorityLow, 0, configMINIMAL_STACK_SIZE * 2);
  CADTaskHandle = osThreadCreate(osThread(CADTask), NULL);
  
  /* PE task to be created on attachment */
  PETaskHandle = NULL;
  
  return USBPD_OK;
}

/**
  * @brief  Main task for PE layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_PE_Task(void const *argument)
{
  for(;;)
  {
    USBPD_PE_SNKProcess(USBPD_PORT_0);
    
    VDMCounter++;
    if (VDMCounter == 500)
    {
      USBPD_VDM_Notif();
      VDMCounter = 0;
    }

    osDelay(2);
  }
}


/**
  * @brief  Main task for CAD layer
  * @param  argument Not used
  * @retval None
  */
void USBPD_CAD_Task(void const *argument)
{
  for(;;)
  {
    USBPD_CAD_Process();
    osDelay(20);
  }
}


/**
  * @brief  CallBack reporting events on a specified port from CAD layer.
  * @param  PortNum The handle of the port
  * @param  State CAD state
  * @param  Cc	The Communication Channel for the USBPD communication
  * @retval None
  */
void USBPD_CAD_Callback(uint8_t PortNum, USBPD_CAD_STATE State, CCxPin_TypeDef Cc)
{
  if ( (PortNum==USBPD_PORT_0) && (State == USBPD_CAD_STATE_ATTACHED) )
  {
    /* An ufp is attached on the port*/
#ifdef USBPD_LED_SERVER
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_BLINK_CC(Cc), 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_BLINK_VBUS, 0);
#endif /* USBPD_LED_SERVER */

    USBPD_PE_IsCableConnected(PortNum, 1);
    DPM_Ports[PortNum].DPM_IsConnected = 1;
    /* Create PE task */
    if (PETaskHandle == NULL)
    {
      osThreadDef(PETask, USBPD_PE_Task, osPriorityHigh, 0, configMINIMAL_STACK_SIZE * 2);
      PETaskHandle = osThreadCreate(osThread(PETask), NULL);
    }
  }
  else if ((PortNum==USBPD_PORT_0)&&( State==USBPD_CAD_STATE_DETACHED ))
  {
    osDelay(100);
    /* The ufp is detached */
    USBPD_PE_IsCableConnected(PortNum, 0);
    /* Terminate PE task */
    if (PETaskHandle != NULL)
    {
      osThreadTerminate(PETaskHandle);
      PETaskHandle = NULL;
    }
    DPM_Ports[PortNum].DPM_IsConnected = 0;

#ifdef USBPD_LED_SERVER      
    /* Led feedback */
    Led_Set(DPM_Leds[PortNum].CCLine, LED_MODE_OFF, 0);
    Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_OFF, 0);
#endif /* USBPD_LED_SERVER */
  }
  osDelay(10);
}


/**
  * @brief  Callback function called by PE layer when HardReset message received from PRL
  * @param  PortNum The current port number
  * @retval None
  */
static uint32_t USBPD_DPM_HardReset(uint8_t PortNum)
{
  /* Reset the power supply */
  USBPD_PWR_IF_PowerReset(PortNum);
  return 1;
}


/**
  * @brief  Request the DPM to setup the new power level.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_SetupNewPower(uint8_t PortNum)
{
  uint8_t rdoposition;

  /* Retrieve Request DO position from DPM handle : RDO position in the table of PDO (possible value from 1 to 7) */
  rdoposition = DPM_Ports[PortNum].DPM_RDOPosition;

  /* Check if get the right pdo position */
  if (rdoposition > 0)
  {
    USBPD_PWR_IF_SetProfile(PortNum, rdoposition-1);
  }
  else
  {
    /* Put it to VSafe5V */
    USBPD_PWR_IF_SetProfile(PortNum, 0);
  }
}


/**
  * @brief  Callback function called by PE to inform DPM that an Explicit contract is established.
  * @param  PortNum The current port number
  * @retval None
  */
static void USBPD_DPM_ExplicitContractDone(uint8_t PortNum)
{
  /* Turn On VBUS LED when an explicit contract is established */
#ifdef USBPD_LED_SERVER
  Led_Set(DPM_Leds[PortNum].VBus, LED_MODE_ON, 0);
#endif /* USBPD_LED_SERVER */
}

/**
  * @brief  DPM callback to allow PE to retrieve information from DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be read from DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_SRC_PDO Source PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_SNK_PDO Sink PDO reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Received Source PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Received Sink PDO values reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Requested voltage value reading requested
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Request message DO reading requested (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data should be written (u32 pointer)
  * @param  Size Pointer on nb of u32 written by DPM
  * @retval None
  */
static void USBPD_DPM_GetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t *Size)
{
  uint32_t index = 0;

  /* Check type of information targeted by request */
  switch (DataId)
  {
    /* Case Port Source PDO Data information :
       Case Port SINK PDO Data information :
         Call PWR_IF PDO reading request.
    */
    case USBPD_CORE_DATATYPE_SRC_PDO :
    case USBPD_CORE_DATATYPE_SNK_PDO :
      USBPD_PWR_IF_GetPortPDOs(PortNum, DataId, Ptr, Size);
      break;

    /* Case Port Received Source PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SRC_PDO : 
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSRCPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Port Received Sink PDO Data information (from distant port) */
    case USBPD_CORE_DATATYPE_RCV_SNK_PDO :
      for(index = 0; index < DPM_Ports[PortNum].DPM_NumberOfRcvSNKPDO; index++)
      {
        *(uint32_t*)(Ptr + index) = DPM_Ports[PortNum].DPM_ListOfRcvSNKPDO[index];
      }
      *Size = DPM_Ports[PortNum].DPM_NumberOfRcvSRCPDO;
      break;

    /* Case Requested voltage value Data information */
    case USBPD_CORE_DATATYPE_REQ_VOLTAGE :
      *Ptr = DPM_Ports[PortNum].DPM_RequestedVoltage;
      *Size = 1;
      break;

    /* Case Request message DO (from Sink to Source) Data information */
    case USBPD_CORE_DATATYPE_REQUEST_DO :
      *Ptr = DPM_Ports[PortNum].DPM_RequestDOMsg;
      *Size = 1;
      break;

    /* In case of unexpected data type (reading request could not be fulfilled) :
       Set nb of read u32 to 0.
    */
    default :
      *Size = 0;
      break;
  }
}

/**
  * @brief  DPM callback to allow PE to update information in DPM/PWR_IF.
  * @param  PortNum Port number
  * @param  DataId Type of data to be updated in DPM
  *         This parameter can be one of the following values:
  *           @arg @ref USBPD_CORE_DATATYPE_RDO_POSITION Storage of requested DO position in PDO list
  *           @arg @ref USBPD_CORE_DATATYPE_REQ_VOLTAGE Storage of requested voltage value
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SRC_PDO Storage of Received Source PDO values 
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_SNK_PDO Storage of Received Sink PDO values
  *           @arg @ref USBPD_CORE_DATATYPE_RCV_REQ_PDO Storage of Received Sink Request PDO value
  *           @arg @ref USBPD_CORE_DATATYPE_REQUEST_DO  Storage of Request message DO (from Sink to Source)
  * @param  Ptr Pointer on address where DPM data to be updated could be read (u32 pointer)
  * @param  Size nb of u32 to be updated in DPM
  * @note   In case of USBPD_CORE_DATATYPE_RDO_POSITION or USBPD_CORE_DATATYPE_REQ_VOLTAGE 
  *         data information types, Size value is expected to be equal to 1.
  * @retval None
  */
static void USBPD_DPM_SetDataInfo(uint8_t PortNum, USBPD_CORE_DataInfoType_TypeDef DataId, uint32_t *Ptr, uint32_t Size)
{
  uint32_t index;
#if defined(USBPD_REV30_SUPPORT)
  USBPD_BSDO battery_status;
#endif /* USBPD_REV30_SUPPORT */

